Revit 2027 API
IFCLegacyStairOrRamp.GetNumberOfTreads Method
 Gets the number of treads.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetNumberOfTreads()
Public Function GetNumberOfTreads As IList(Of Integer)
public:
IList<int>^ GetNumberOfTreads()
member GetNumberOfTreads : unit -> IList<int>
Return Value
IList<Int32>
 The list of numbers of treads.
See Also
Reference
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace